scc2425-tukano/src/main/test/scc2425-artillery-tests/upload_shorts_out_main.txt
Test run id: t9q48_yjwnx6ye74crcmbpy5fq3rkhmygth_dzqx
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Main test (index: 0, duration: 30s) 01:14:44(+0000)

--------------------------------------
Metrics for period to: 01:14:50(+0000) (width: 4.675s)
--------------------------------------

http.codes.200: ................................................................ 49
http.codes.204: ................................................................ 46
http.codes.403: ................................................................ 1
http.codes.404: ................................................................ 1
http.downloaded_bytes: ......................................................... 17075
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 2101
  mean: ........................................................................ 306.7
  median: ...................................................................... 198.4
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 1755
http.response_time.2xx:
  min: ......................................................................... 69
  max: ......................................................................... 2101
  mean: ........................................................................ 312
  median: ...................................................................... 198.4
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 1755
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 110
  mean: ........................................................................ 56
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 97
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 46
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  49
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 2
  max: ......................................................................... 1294
  mean: ........................................................................ 269
  median: ...................................................................... 159.2
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1200.1
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 110
  max: ......................................................................... 2101
  mean: ........................................................................ 342.2
  median: ...................................................................... 202.4
  p95: ......................................................................... 1274.3
  p99: ......................................................................... 1755
vusers.completed: .............................................................. 47
vusers.created: ................................................................ 50
vusers.created_by_name.Upload short: ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 117
  max: ......................................................................... 2228.2
  mean: ........................................................................ 627.9
  median: ...................................................................... 376.2
  p95: ......................................................................... 1436.8
  p99: ......................................................................... 1863.5


--------------------------------------
Metrics for period to: 01:15:00(+0000) (width: 9.939s)
--------------------------------------

http.codes.200: ................................................................ 99
http.codes.204: ................................................................ 99
http.codes.403: ................................................................ 1
http.codes.404: ................................................................ 1
http.downloaded_bytes: ......................................................... 34542
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 582
  mean: ........................................................................ 188.1
  median: ...................................................................... 194.4
  p95: ......................................................................... 214.9
  p99: ......................................................................... 478.3
http.response_time.2xx:
  min: ......................................................................... 100
  max: ......................................................................... 582
  mean: ........................................................................ 189.5
  median: ...................................................................... 194.4
  p95: ......................................................................... 214.9
  p99: ......................................................................... 478.3
http.response_time.4xx:
  min: ......................................................................... 3
  max: ......................................................................... 101
  mean: ........................................................................ 52
  median: ...................................................................... 3
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 200
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 99
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 1
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  99
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  1
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 3
  max: ......................................................................... 367
  mean: ........................................................................ 161.1
  median: ...................................................................... 159.2
  p95: ......................................................................... 210.6
  p99: ......................................................................... 267.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 101
  max: ......................................................................... 582
  mean: ........................................................................ 215.2
  median: ...................................................................... 202.4
  p95: ......................................................................... 333.7
  p99: ......................................................................... 528.6
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Upload short: ........................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 107.9
  max: ......................................................................... 754
  mean: ........................................................................ 380.5
  median: ...................................................................... 361.5
  p95: ......................................................................... 507.8
  p99: ......................................................................... 713.5


Phase completed: Main test (index: 0, duration: 30s) 01:15:14(+0000)

--------------------------------------
Metrics for period to: 01:15:10(+0000) (width: 9.939s)
--------------------------------------

http.codes.200: ................................................................ 100
http.codes.204: ................................................................ 100
http.downloaded_bytes: ......................................................... 35022
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 106
  max: ......................................................................... 273
  mean: ........................................................................ 182.4
  median: ...................................................................... 194.4
  p95: ......................................................................... 206.5
  p99: ......................................................................... 219.2
http.response_time.2xx:
  min: ......................................................................... 106
  max: ......................................................................... 273
  mean: ........................................................................ 182.4
  median: ...................................................................... 194.4
  p95: ......................................................................... 206.5
  p99: ......................................................................... 219.2
http.responses: ................................................................ 200
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 100
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  100
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 106
  max: ......................................................................... 273
  mean: ........................................................................ 163.7
  median: ...................................................................... 159.2
  p95: ......................................................................... 210.6
  p99: ......................................................................... 223.7
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 189
  max: ......................................................................... 218
  mean: ........................................................................ 201.2
  median: ...................................................................... 202.4
  p95: ......................................................................... 206.5
  p99: ......................................................................... 210.6
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Upload short: ........................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 310.1
  max: ......................................................................... 485.9
  mean: ........................................................................ 368.4
  median: ...................................................................... 361.5
  p95: ......................................................................... 415.8
  p99: ......................................................................... 424.2


--------------------------------------
Metrics for period to: 01:15:20(+0000) (width: 5.098s)
--------------------------------------

http.codes.200: ................................................................ 50
http.codes.204: ................................................................ 53
http.downloaded_bytes: ......................................................... 17467
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 105
  max: ......................................................................... 286
  mean: ........................................................................ 183.3
  median: ...................................................................... 194.4
  p95: ......................................................................... 214.9
  p99: ......................................................................... 219.2
http.response_time.2xx:
  min: ......................................................................... 105
  max: ......................................................................... 286
  mean: ........................................................................ 183.3
  median: ...................................................................... 194.4
  p95: ......................................................................... 214.9
  p99: ......................................................................... 219.2
http.responses: ................................................................ 103
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 53
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  50
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 105
  max: ......................................................................... 286
  mean: ........................................................................ 164.8
  median: ...................................................................... 159.2
  p95: ......................................................................... 214.9
  p99: ......................................................................... 219.2
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 193
  max: ......................................................................... 223
  mean: ........................................................................ 202.9
  median: ...................................................................... 202.4
  p95: ......................................................................... 210.6
  p99: ......................................................................... 219.2
vusers.completed: .............................................................. 53
vusers.created: ................................................................ 50
vusers.created_by_name.Upload short: ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 304.5
  max: ......................................................................... 495.3
  mean: ........................................................................ 370.8
  median: ...................................................................... 361.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 432.7


All VUs finished. Total time: 32 seconds

--------------------------------
Summary report @ 01:15:17(+0000)
--------------------------------

http.codes.200: ................................................................ 298
http.codes.204: ................................................................ 298
http.codes.403: ................................................................ 2
http.codes.404: ................................................................ 2
http.downloaded_bytes: ......................................................... 104106
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 2101
  mean: ........................................................................ 204.6
  median: ...................................................................... 194.4
  p95: ......................................................................... 262.5
  p99: ......................................................................... 1022.7
http.response_time.2xx:
  min: ......................................................................... 69
  max: ......................................................................... 2101
  mean: ........................................................................ 205.6
  median: ...................................................................... 194.4
  p95: ......................................................................... 262.5
  p99: ......................................................................... 1022.7
http.response_time.4xx:
  min: ......................................................................... 2
  max: ......................................................................... 110
  mean: ........................................................................ 54
  median: ...................................................................... 3
  p95: ......................................................................... 100.5
  p99: ......................................................................... 100.5
http.responses: ................................................................ 600
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 298
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.403: ........ 2
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  298
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  2
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 2
  max: ......................................................................... 1294
  mean: ........................................................................ 179.5
  median: ...................................................................... 159.2
  p95: ......................................................................... 267.8
  p99: ......................................................................... 982.6
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 101
  max: ......................................................................... 2101
  mean: ........................................................................ 229.6
  median: ...................................................................... 202.4
  p95: ......................................................................... 219.2
  p99: ......................................................................... 1274.3
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.Upload short: ........................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 107.9
  max: ......................................................................... 2228.2
  mean: ........................................................................ 413.5
  median: ...................................................................... 368.8
  p95: ......................................................................... 584.2
  p99: ......................................................................... 1436.8